Revit 2027 API
PointCloudFilter.TestPoint Method
Checks if a point is inside the volume of interest.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool TestPoint(
	CloudPoint point
)
Public Overridable Function TestPoint (
	point As CloudPoint
) As Boolean
public:
virtual bool TestPoint(
	CloudPoint point
)
abstract TestPoint :
        point : CloudPoint -> bool
override TestPoint :
        point : CloudPoint -> bool
Parameters
point CloudPoint
The point to be tested.
Return Value
Boolean
If true, the point is accepted, if false, the point is not accepted.
See Also
Reference
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace